Table of Contents
 Class OpenModelContainer
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
OpenModelContainer is used to keep structural data and results of a finite element analysis in one place. The main reason is easier moving (passing) pass the instance of OpenModel and corresponding instace of OpenModelResults.
public class OpenModelContainer
Inheritance
object
OpenModelContainer
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 OpenModel
Open Model - structural data
public OpenModel OpenModel { get; set; }
Property Value
OpenModel
 OpenModelResult
Open Model Result - results of a finite element analysis
public OpenModelResult OpenModelResult { get; set; }
Property Value
OpenModelResult
 Edit this page